
// 4.1. [# 100] Задан орграф 𝐺 = (𝑉, 𝐸), где 𝑉 – множество вершин, 𝐸 – множество ребер,
// |V|=n. Каждой дуге 𝑒 ∈ 𝐸 поставлено в соответствие положительное вещественное
// число 𝑐(𝑒) – пропускная способность. Вершину с номером 0 назовём источником, а
// вершину с номером 𝑛 − 1 стоком. Требуется найти максимальный поток.
// Вход. Первая строка исходного файла содержит целое число 𝑛 (1 ≤ 𝑛 ≤ 400) –
// количество вершин. В последующих 𝑛 строках содержатся по 𝑛 чисел, разделенных
// пробелами: пропускная способность между вершинами. Вершины пронумерованы от 0
// до 𝑛 − 1.
// Выход. Первая строка исходного файла содержит целое число 𝑛 – количество вершин.
// В последующих 𝑛 строках содержатся по 𝑛 чисел, разделенных пробелами: величина
//потока между вершинами.
int main(int argc, char* argv[])
{
    
    return 0;
}
