

/* 1.6. [# 35] Задача об укладке рюкзака.
	Есть 𝑛 различных предметов. Каждый предмет с номером 𝑖, где 𝑖=1,…,𝑛, имеет заданный положительный вес 𝑤_𝑖 и стоимость 𝑐_𝑖.
	Нужно уложить рюкзак так, чтобы общая стоимость предметов в нем была не менее 𝑆, а вес не превышал заданного 𝑇. Форма предметов значения не имеет
	Вход. В первой строке три числа 𝑛,𝑇 и 𝑆, в следующих 𝑛 строчках – по два числа (вес 𝑤_𝑖 и стоимость 𝑐_𝑖)
	Выход. В первой строке – вес получившегося рюкзака, во второй строчке строка из 0 и 1 поясняющих какие предметы берутся, а какие – не берутся.
 */
int main(int argc, char* argv[])
{
    
    return 0;
}
